{
    "data": {
    "variants": [
    {
        "name": "Full Body Workout",
        "subcategories": [
        {
            "title": "Push-Ups",
            "description": "Legs extended back and balancing the straight body on hands and toes. The arms are flexed to alower and raise the body. Repetitions are counted when the body returns to the starting position.",
            "images": "https://www.fitstream.com/images/bodyweight-training/bodyweight-exercises/push-up.png",
            "youtube_link": "lsRAK6cr5kY",
            "duration": 20
        },
        {
            "title": "Squats",
            "description": "The body is lowered at the hips from a standing position and then stands back up to complete a repetition. Hands are push in front for balancing.",
            "images": "https://st2.depositphotos.com/4197925/11012/v/450/depositphotos_110129366-stock-illustration-aerobic-icons-full-color-05.jpg",
            "youtube_link": "eIsdkGJjX3s",
            "duration": 20
        },
        {
            "title": "Lunges",
            "description": "One leg is positioned forward with knee bent and foot flat on the ground while the other leg is positioned behind. The position of the legs is repeatedly swapped.",
            "images": "http://clipart-library.com/image_gallery/406286.jpg",
            "youtube_link": "d9oyRSHn2Pg",
            "duration": 20
        },
        {
            "title": "Jumping Jacks",
            "description": "Starting with the arms on the side and the legs brought together. By a jump into the air, simultaneously the legs are spread and the hands are pushed up to touch overhead. A repetition is completed with another jump returning to the starting position.",
            "images": "http://irl.depaul.edu/wp-content/uploads/2020/05/256-2569618_moves-clipart-kid-jumping-jacks-exercise.png",
            "youtube_link": "eFpaVPr4d3M",
            "duration": 20
        }
        ]
    },
    {
        "name": "Lower Body Workout",
        "subcategories": [
        {
            "title": "Dumbbell Squat",
            "description": "Stand with your feet hip to shoulder-width apart, holding a pair of dumbbells at arm’s length by your sides.Keeping your back flat, chest up, and core braced, push your hips back, bend your knees, and lower your body until your thighs are parallel to the floor.Pause, then push yourself back up to the starting position.",
            "images": "https://static.strengthlevel.com/images/illustrations/dumbbell-squat-1000x1000.jpg",
            "youtube_link": "R7iGFo0Y498",
            "duration": 20
        },
        {
            "title": " Glute Bridge",
            "description": "Lie on your back, arms down by your sides. Bend your knees and plant your feet flat on the floor.Pull in through your navel to brace your core muscles and then squeeze your glutes to press your hips up so your body forms a straight line — no arching — from knees to shoulders.Keep your head on the floor and eyes focused on the ceiling.Hold the position for a beat, and then lower and lift, and repeat.",
            "images": "https://static.strengthlevel.com/images/illustrations/glute-bridge-1000x1000.jpg",
            "youtube_link": "YdyjfNnkUQk",
            "duration": 20
        },
        {
            "title": "Calf Raises",
            "description": "Stand with your feet together and hold a dumbbell in each hand by your sides. Lift your heels off the floor, balancing on your toes. Hold for a few seconds and then bring your heels back down to the ground.",
            "images": "https://static.strengthlevel.com/images/illustrations/machine-calf-raise-1000x1000.jpg",
            "youtube_link": "rRbXxYuyVpo",
            "duration": 20
        },
        {
            "title": "Lateral Lunge",
            "description": "Stand with your feet together and hold a medium-heavy set of dumbbells. Take a big step to your right side and lower down into a lunge, hinging forward at the hips and keeping your chest lifted. Be sure both feet are firmly planted on the floor and toes are facing straight. Push off with your right foot to come back to the starting position while keeping your left foot on the floor. This is one rep. Alternate sides.",
            "images": "https://s3.amazonaws.com/prod.skimble/assets/2286935/image_iphone.jpg",
            "youtube_link": "6DMXBtF_Spg",
            "duration": 20
        }
        ]
    },
    {
        "name": "Abs Workout",
        "subcategories": [
        {
            "title": "Burpee",
            "description": "Stand with your feet shoulder-width apart. Squat and place your palms on the floor. Keeping your hands on the floor, immediately kick your legs behind you so that you end up in the top of a push-up position. Do a push-up and return to the top position. Still keeping your hands on the floor, quickly draw up your legs so your feet land back between your hands. Now, jump vertically with your hands reaching overhead above your ears. That's one rep.",
            "images": "https://www.shutterstock.com/image-vector/burpees-exercise-woman-workout-fitness-260nw-1857256408.jpg",
            "youtube_link": "auBLPXO8Fww",
            "duration": 20
        },
        {
            "title": " Jackknife Sit-Up",
            "description": "Lie on your back with your legs straight out on the floor, your arms extended above your head, and your hands touching the floor. This is the starting position. Bring your body to a \"V\" shape by lifting your legs and torso toward each other, keeping both your legs straight and your arms extended. Lift your shoulder blades off the ground as you raise your legs as close to perpendicular to the floor as you can. Touch your hands to your legs, then lower your torso, arms, and legs back to the floor. That's one rep.",
            "images": "https://www.shutterstock.com/image-vector/woman-doing-toe-touches-jackknife-260nw-1970830676.jpg",
            "youtube_link": "rPdKujjS0fw",
            "duration": 20
        },
        {
            "title": "Oblique Crunch",
            "description": "Lie on your back on the floor. Keep your legs bent in the air at a 90-degree angle. Place your hands on the back of your head with your elbows flared out to each side. This is the starting position. Twist (rotate) your torso to move your right shoulder toward your left thigh until your upper back is off the floor and your right elbow is close to or touching your left knee. Lower yourself back down to the starting position. Repeat the movement, this time rotating your left shoulder toward your right knee. Alternate reps between your right and left sides.",
            "images": "https://cdn4.vectorstock.com/i/1000x1000/21/78/man-doing-oblique-crunch-exercise-flat-vector-42922178.jpg",
            "youtube_link": "AcvfBd9C2kA",
            "duration": 20
        },
        {
            "title": "Plank",
            "description": "Assume the top push-up position. Now bend your elbows and place your forearms flat on the floor beneath you. Tighten your ab muscles to keep your back flat. Make sure your toes are pointed into the ground. Hold the position for the prescribed duration.",
            "images": "https://t3.ftcdn.net/jpg/02/77/23/32/360_F_277233250_NIwVrOKQvXNOmHjHOZWoMHKjSLLzFttS.jpg",
            "youtube_link": "HgC7ieiarVg",
            "duration": 20
        }
        ]
    }
    ]
}
}