[
  {
    "title": "Push-Ups",
    "description": "Legs extended back and balancing the straight body on hands and toes. The arms are flexed to alower and raise the body. Repetitions are counted when the body returns to the starting position.",
    "images": "https://www.fitstream.com/images/bodyweight-training/bodyweight-exercises/push-up.png",
    "youtube_link": "lsRAK6cr5kY",
    "duration": 20
  },
  {
    "title": "Squats",
    "description": "The body is lowered at the hips from a standing position and then stands back up to complete a repetition. Hands are push in front for balancing.",
    "images": "https://st2.depositphotos.com/4197925/11012/v/450/depositphotos_110129366-stock-illustration-aerobic-icons-full-color-05.jpg",
    "youtube_link": "eIsdkGJjX3s",
    "duration": 20
  },
  {
    "title": "Lunges",
    "description": "One leg is positioned forward with knee bent and foot flat on the ground while the other leg is positioned behind. The position of the legs is repeatedly swapped.",
    "images": "https://static.vecteezy.com/system/resources/previews/005/178/342/original/woman-doing-anjaneyasana-or-low-lunge-yoga-pose-illustration-in-trendy-style-free-vector.jpg",
    "youtube_link": "d9oyRSHn2Pg",
    "duration": 20
  },
  {
    "title": "Jumping Jacks",
    "description": "Starting with the arms on the side and the legs brought together. By a jump into the air, simultaneously the legs are spread and the hands are pushed up to touch overhead. A repetition is completed with another jump returning to the starting position.",
    "images": "https://www.wikihow.com/images/thumb/c/ce/Perform-Jumping-Jacks-Step-6-Version-4.jpg/v4-460px-Perform-Jumping-Jacks-Step-6-Version-4.jpg.webp",
    "youtube_link": "eFpaVPr4d3M",
    "duration": 20
  },
  {
    "title": " Glute Bridge",
    "description": "Lie on your back, arms down by your sides. Bend your knees and plant your feet flat on the floor.Pull in through your navel to brace your core muscles and then squeeze your glutes to press your hips up so your body forms a straight line — no arching — from knees to shoulders.Keep your head on the floor and eyes focused on the ceiling.Hold the position for a beat, and then lower and lift, and repeat.",
    "images": "https://static.strengthlevel.com/images/illustrations/glute-bridge-1000x1000.jpg",
    "youtube_link": "YdyjfNnkUQk",
    "duration": 20
  },
  {
    "title": "Calf Raises",
    "description": "Stand with your feet together and hold a dumbbell in each hand by your sides. Lift your heels off the floor, balancing on your toes. Hold for a few seconds and then bring your heels back down to the ground.",
    "images": "https://static.strengthlevel.com/images/illustrations/machine-calf-raise-1000x1000.jpg",
    "youtube_link": "rRbXxYuyVpo",
    "duration": 20
  },
  {
    "title": "Lateral Lunge",
    "description": "Stand with your feet together and hold a medium-heavy set of dumbbells. Take a big step to your right side and lower down into a lunge, hinging forward at the hips and keeping your chest lifted. Be sure both feet are firmly planted on the floor and toes are facing straight. Push off with your right foot to come back to the starting position while keeping your left foot on the floor. This is one rep. Alternate sides.",
    "images": "https://s3.amazonaws.com/prod.skimble/assets/2286935/image_iphone.jpg",
    "youtube_link": "6DMXBtF_Spg",
    "duration": 20
  }
]